{
    "home": {
        "abstract" : "The world is in constant flux. Knowledge allows the traversal of its ever changing landscapes, shining a light at it's darkest corners."
    },
    "about":{
        "abstract" : "Harnessing a rich blend of theoretical physics and multifaceted professional expertise, I am a dynamic consultant and developer committed to crafting innovative software solutions, underscored by a relentless pursuit of excellence and growth across a diverse range of sectors.",
        "devPanel" : {
            "experienceScope" : "Experience in both front- and back-end development for an extremely varied scope of projects, including building UIs and web-apps using React; Building and deploying online REST APIs using WL or JS; Or building desktop applications using WL, always strictly adhering to the agile SDLC methodology and DevOps lifecycle.",
            "languageExperience" : "Having experience in both object oriented- and function programming owing to the symbolic functional programming within WL and the object-oriented programming of JS and C++",
            "auxiliaryExperience" : "Almost all project also involved the building and maintaining of multiple auxiliary systems like SQL databases; Python and shell scripts; Docker containerisation scripts and others.",
            "testingExperience" : "Projects were also supported by testing suites which included unit and integration tests (WL and JS), “robot” testing of front-end interfaces, and custom git scripts to validate any pushes or merges using the appropriate tests.",
            "personalExperience": "Coding is my passion and so I undertake various personal project on my personal time including a POSsystem based on React, an algorithm trading bot in python and numerous coding challenges using C++."
        },
        "teachPanel" : {
            "talks" : {
                "showcase" : "Coding a Path Integral Monte Carlo Simulator in WL",
                "caseStudy" : "Exploring Mars using NASA's MarsRoverAPI",
                "tutorial" : "Customizing Mathematica using Stylesheets"
            },
            "teachingScope" : "Experience in writing technical content showcasing how the WL for various applications like physics, chemistry, and so on. The presentations followed 3 main types: Lessons, Showcases, Case studies. I wrote 3 unique talks, 1 of each type, and contributed to countless others, by either updating the content, updating or bug fixing demos, or modernizing old presentations.",
            "teachingExperience" : "I also taught, WL101 and “Hands-on start to Mathematica” to hundreds of university students and private company engineers, both online and in person with workshop type tutorials or formal lectures on the WL with class sizes ranging anywhere from 1 to over 50. Some of the universities I visited include UCL, KCL, UCDublin, UOAberdeen among others."
        },
        "modelPanel" : {
            "modelScope" : "Having a theoretical physics background, I excelled in any projects that included mathematical/simulation modeling and optimization, having simulated many physical systems inside python. ",
            "modelExperience" : "My first customer project at WREL was an industrial machine setting optimization algorithm intended to find settings for a combination of machines as to minimize the required power. I provided the customer with multiple options of solution including a Lagrange multiplier local optimization and also a custom algorithm I developed for generating a machine settings combination tensor, extracting the surface of settings matching required output and then finding the minimum of that surface and also a method utilizing WL’s build in NMinimize function. A separate algorithm then had to be developed for the best choice of machines at a given output which again uses a bespoke algorithm I designed. Both of these were then delivered as online APIs."
        },
        "academicPanel" : {
            "bsc" : {
                "degreeName" : "BSc Theoretical Physics",
                "date" : "October 2017 – June 2021",
                "location" : "Swansea University",
                "award" : "First Class Honors",
                "thesisName" : "Demonstrating the derivation, coding and use of a PIMC Simulation",
                "thesisDescription" : "My thesis outlines Feynman’s path integral formulation of quantum dynamics and the challenges of solving its infinite dimensional integrals. It then outlines the creation of a python program which uses the Metropolis Hastings Algorithm (aka ‘Monte Carlo’ algorithm) to find a numeric approximation of various observables of a given system like the vacuum energy or probability density of the system. This is done by solving Feynman’s equations using the Euler-Lagrange equation together with the Monte Carlo algorithm to minimize the system’s action. It concludes by comparing the accuracy of this method with methods like quantum perturbation theory."
            }
        },
        "workPanel" : {
            "wolfram" : {
                "name" : "Wolfram Research Europe Ltd",
                "position" : "Technical Consultant",
                "location" : "Oxfordshire",
                "date" : "July 2022 - Present",
                "experience" : {
                    "scopeExp" : {
                        "title" : "Scope and design solution projects",
                        "label" : "Experience",
                        "desc" : "Acted as first technical contact with customers, communicating on their specific needs and scoping the projects for the drafting of the technical agreement."
                    },
                    "clientExp" : {
                        "title" : "Meet with- and present to clients",
                        "desc"  : "Meet with customers and stakeholders of ongoing projects, discussing progress and ensuring adherence to the customers vision.",
                        "label" : "Experience"
                    },
                    "teachExp" : {
                        "title" : "Teach and present the Wolfram Language",
                        "desc" : "WIP",
                        "label" : "Experience"
                    },
                    "cogniTool" : {
                        "title" : "Medically certified cognitive testing web application ",
                        "desc"  : "WIP",
                        "label" : "Project"
                    },
                    "bpTool" : {
                        "title" : "Desktop application for hypertensive patient tracking and treatment plan creation",
                        "desc" : "WIP",
                        "label" : "Project"
                    },
                    "interventionsTool" : {
                        "title" : "Importing, structuring and visualizing framework for Census 2012",
                        "desc" : "WIP",
                        "label" : "Project"
                    },
                    "legalTool" : {
                        "title" : "Workplace law desktop application to more effectively and efficiently compute client restructures",
                        "desc" : "WIP",
                        "label" : "Project"
                    },
                    "fanTool" : {
                        "title" : "API suite for industrial machine power-draw optimization and optimal machine combination",
                        "desc" : "WIP",
                        "label" : "Project"
                    },
                    "priceTool" : {
                        "title" : "Interactive price fetching and displaying web application",
                        "desc" : "WIP",
                        "label" : "Project"
                    },
                    "wasTool" : {
                        "title" : "Wolfram Application Server deployment",
                        "desc" : "WIP",
                        "label" : "Project"
                    }
                }
            }
        }
    }
}